OpenFOAM-v1812/tutorials/incompressible/simpleFoam/simpleCar/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(body|upperWall|lowerWall)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
